njila_load_results.txt


  ███╗   ██╗     ██╗██╗██╗      █████╗ 
  ████╗  ██║     ██║██║██║     ██╔══██╗
  ██╔██╗ ██║     ██║██║██║     ███████║
  ██║╚██╗██║██   ██║██║██║     ██╔══██║
  ██║ ╚████║╚█████╔╝██║███████╗██║  ██║
  ╚═╝  ╚═══╝ ╚════╝ ╚═╝╚══════╝╚═╝  ╚═╝
     🚀 LOAD TEST — 500 req/s | 60s par test

Sélectionne les services à tester (séparés par espace, ou 'all'):
  1) AUTH       2) USER       3) FLEET
  4) BOOKING    5) PAYMENT    6) NOTIFICATION    7) SUBSCRIBE

Choix [all] : 🔄  Rafraîchissement du token JWT...
✅  Token rafraîchi

══ 5. NOTIFICATION SERVICE ══

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔥 TEST : NOTIF — GET /api/notifications (mes notifs)
CMD : hey -z 60s -q 500 -c 100 -t 30       -H 'Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI1YmJiNmViZS02NTE5LTQ1YjQtOWQwNC1iZDExMjFmYzA2ODgiLCJyb2xlIjoiQURNSU5JU1RSQVRFVVIiLCJzZXNzaW9uX2lkIjoiNjVjZmYxN2EtNjVkNy00YzcyLTk2MzQtYzg4ZDlmYzQ2N2MxIiwiZmlsaWFsZV9pZCI6bnVsbCwiYWdlbmNlX2lkIjpudWxsLCJpYXQiOjE3NzkwNTc0NjQsImV4cCI6MTc3OTA2OTQ2NCwianRpIjoiMGYwZmZmNjMtNGY0Yy00NWVlLWIzMjQtYTM4NzQxYWM4NjA1In0.VwKaphCMrD4uCnvCPnRKXpl0Tu7QdFergMeqN5iHYu4'       http://localhost:8888/api/notifications
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

Summary:
  Total:	60.2200 secs
  Slowest:	0.3903 secs
  Fastest:	0.1217 secs
  Average:	0.2150 secs
  Requests/sec:	464.0983
  
  Total data:	4359888 bytes
  Size/request:	156 bytes

Response time histogram:
  0.122 [1]	|
  0.149 [1031]	|■■■■
  0.175 [11622]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.202 [1274]	|■■■■
  0.229 [107]	|
  0.256 [595]	|■■
  0.283 [10678]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.310 [1917]	|■■■■■■■
  0.337 [556]	|■■
  0.363 [162]	|■
  0.390 [5]	|


Latency distribution:
  10% in 0.1508 secs
  25% in 0.1546 secs
  50% in 0.2057 secs
  75% in 0.2645 secs
  90% in 0.2812 secs
  95% in 0.3026 secs
  99% in 0.3281 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.1217 secs, 0.3903 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0065 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0057 secs
  resp wait:	0.2148 secs, 0.1195 secs, 0.3795 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [404]	27948 responses



✅  Terminé : NOTIF — GET /api/notifications (mes notifs)

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔥 TEST : NOTIF — PUT /api/notifications/:id/read (marquer lu)
CMD : hey -z 60s -q 500 -c 100 -t 30       -m PUT       -H 'Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI1YmJiNmViZS02NTE5LTQ1YjQtOWQwNC1iZDExMjFmYzA2ODgiLCJyb2xlIjoiQURNSU5JU1RSQVRFVVIiLCJzZXNzaW9uX2lkIjoiNjVjZmYxN2EtNjVkNy00YzcyLTk2MzQtYzg4ZDlmYzQ2N2MxIiwiZmlsaWFsZV9pZCI6bnVsbCwiYWdlbmNlX2lkIjpudWxsLCJpYXQiOjE3NzkwNTc0NjQsImV4cCI6MTc3OTA2OTQ2NCwianRpIjoiMGYwZmZmNjMtNGY0Yy00NWVlLWIzMjQtYTM4NzQxYWM4NjA1In0.VwKaphCMrD4uCnvCPnRKXpl0Tu7QdFergMeqN5iHYu4'       -H 'Content-Type: application/json'       -d '{"lu":true}'       http://localhost:8888/api/notifications/1/read
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

Summary:
  Total:	60.2131 secs
  Slowest:	0.3602 secs
  Fastest:	0.0417 secs
  Average:	0.2149 secs
  Requests/sec:	464.4003
  
  Total data:	4557969 bytes
  Size/request:	163 bytes

Response time histogram:
  0.042 [1]	|
  0.074 [13]	|
  0.105 [15]	|
  0.137 [7]	|
  0.169 [11955]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.201 [1731]	|■■■■■■
  0.233 [378]	|■
  0.265 [7132]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.296 [4867]	|■■■■■■■■■■■■■■■■
  0.328 [1541]	|■■■■■
  0.360 [323]	|■


Latency distribution:
  10% in 0.1503 secs
  25% in 0.1545 secs
  50% in 0.2165 secs
  75% in 0.2641 secs
  90% in 0.2835 secs
  95% in 0.3031 secs
  99% in 0.3305 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0417 secs, 0.3602 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0067 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0058 secs
  resp wait:	0.2147 secs, 0.0414 secs, 0.3601 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [404]	27963 responses



✅  Terminé : NOTIF — PUT /api/notifications/:id/read (marquer lu)

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔥 TEST : NOTIF — POST /api/notifications/send (admin)
CMD : hey -z 60s -q 500 -c 100 -t 30       -m POST       -H 'Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI1YmJiNmViZS02NTE5LTQ1YjQtOWQwNC1iZDExMjFmYzA2ODgiLCJyb2xlIjoiQURNSU5JU1RSQVRFVVIiLCJzZXNzaW9uX2lkIjoiNjVjZmYxN2EtNjVkNy00YzcyLTk2MzQtYzg4ZDlmYzQ2N2MxIiwiZmlsaWFsZV9pZCI6bnVsbCwiYWdlbmNlX2lkIjpudWxsLCJpYXQiOjE3NzkwNTc0NjQsImV4cCI6MTc3OTA2OTQ2NCwianRpIjoiMGYwZmZmNjMtNGY0Yy00NWVlLWIzMjQtYTM4NzQxYWM4NjA1In0.VwKaphCMrD4uCnvCPnRKXpl0Tu7QdFergMeqN5iHYu4'       -H 'Content-Type: application/json'       -d '{"titre":"Test Load","message":"Notification de test de charge","type":"INFO","userId":"5bbb6ebe-6519-45b4-9d04-bd1121fc0688"}'       http://localhost:8888/api/notifications/send
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

Summary:
  Total:	60.2543 secs
  Slowest:	0.3723 secs
  Fastest:	0.0347 secs
  Average:	0.2135 secs
  Requests/sec:	467.2526
  
  Total data:	4560948 bytes
  Size/request:	162 bytes

Response time histogram:
  0.035 [1]	|
  0.068 [15]	|
  0.102 [19]	|
  0.136 [15]	|
  0.170 [12737]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.203 [1176]	|■■■■
  0.237 [175]	|■
  0.271 [10857]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.305 [2045]	|■■■■■■
  0.338 [1047]	|■■■
  0.372 [67]	|


Latency distribution:
  10% in 0.1512 secs
  25% in 0.1545 secs
  50% in 0.2106 secs
  75% in 0.2642 secs
  90% in 0.2725 secs
  95% in 0.3013 secs
  99% in 0.3150 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0347 secs, 0.3723 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0078 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0091 secs
  resp wait:	0.2133 secs, 0.0307 secs, 0.3721 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0105 secs

Status code distribution:
  [404]	28154 responses



✅  Terminé : NOTIF — POST /api/notifications/send (admin)


  ✅  TOUS LES TESTS TERMINÉS
  📊  Analyse les résultats ci-dessus :
      → Requests/sec réel vs cible (500)
      → Latence P50 / P95 / P99
      → Taux d'erreurs (4xx / 5xx)
      → Circuit Breaker trips (logs Gateway)

💡  Pour voir les circuit breakers :
    curl http://localhost:8888/actuator/circuitbreakerevents | jq .

💡  Pour voir les métriques gateway :
    curl http://localhost:8888/actuator/metrics | jq .